RULES = (
    "🎵 *Правила игры \"Угадай трек\"* 🎵\n\n"
    "После запуска игры ты получишь *5 вопросов* подряд.\n"
    "В каждом вопросе:\n"
    "• Ты услышишь отрывок трека длиной 7-10 секунд.\n"
    "• Будет 4 варианта ответа — выбери правильный.\n"
    "• На ответ даётся *20 секунд*.\n\n"
    "⏱️ Чем быстрее ответишь — тем больше баллов получишь!\n\n"
    "По завершении игры баллы переводятся в рейтинг и добавляются в твою статистику.\n\n"
    "Готов проверить свои музыкальные знания? Тогда начинай игру! 🎧"
)

NO_USERNAME_USER = 'Скрытый меломан'