WELCOME_MESSAGE = """
<b>🎉 Привет, меломан!</b> 🎵\n
Ты попал в <b>Угадай Трек Бот</b> — место, где звучит музыка, а твои знания превращаются в баллы!\n
🎧 Тебя ждут 5 захватывающих вопросов подряд. В каждом — короткий отрывок трека (7–10 секунд) и 4 варианта ответа.\n
⏰ У тебя есть всего 20 секунд на каждый вопрос, так что не тормози!\n
⚡ Чем раньше ответишь — тем больше очков получишь. В конце все баллы превратятся в рейтинг и попадут в твою статистику.\n
Готов проверить, насколько ты настоящий знаток музыки?\n
Нажми кнопку ниже и вперед к игре! ⬇️\n
"""

HOME_MESSAGE = """
<b>🏠 Добро пожаловать домой!</b>\n
Здесь ты можешь начать новую игру, посмотреть правила, узнать свою статистику или посмотреть мировой рейтинг.\n
Выбирай действие в меню ниже и наслаждайся игрой! 🎶\n
"""

RULES = (
    "🎵 *Правила игры \"Угадай трек\"* 🎵\n\n"
    "После запуска игры ты получишь *5 вопросов* подряд.\n"
    "В каждом вопросе:\n"
    "• Ты услышишь отрывок трека длиной 7-10 секунд.\n"
    "• Будет 4 варианта ответа — выбери правильный.\n"
    "• На ответ даётся *20 секунд*.\n\n"
    "⏱️ Чем быстрее ответишь — тем больше баллов получишь!\n\n"
    "По завершении игры баллы переводятся в рейтинг и добавляются в твою статистику.\n\n"
    "Готов проверить свои музыкальные знания? Тогда начинай игру! 🎧"
)

NO_USERNAME_USER = 'Скрытый меломан'
